Revit 2027 API
DirectShape.RemoveReferenceObject(ExternalGeometryId) Method
 Removes any reference object associated with the provided ExternalGeometryId from the DirectShape. Nothing is done if no reference object has the given external ID or if the external ID is an empty string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveReferenceObject(
	ExternalGeometryId externalId
)
Public Sub RemoveReferenceObject (
	externalId As ExternalGeometryId
)
public:
void RemoveReferenceObject(
	ExternalGeometryId^ externalId
)
member RemoveReferenceObject :
        externalId : ExternalGeometryId -> unit
Parameters
externalId ExternalGeometryId
 The ExternalGeometryId of the reference object to be removed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
RemoveReferenceObject Overload
Autodesk.Revit.DB Namespace